# Первые строки кода - как всегда
# Приветствуем мир с запросом нашего имени 
# Python 3.x (act 3.5.2)

# запросим имя 
cname = input ("Введите имя [только буквы в имени]: ")
# Выведем приветствие миру
print ("Hello world!!!!")
# Добавим - от имени кого мы приветствуем мир
print ("Мое имя: " + cname)
# Добавим строки для того чтобы расширить ветку мастер
# для того чтобы провести слияние веток
print ("Привет то что меня окружает...")

print ("Здороваемся с друзьями")
print ("Здороваемся с подругами")


# Слияние прошло - это код - продолжение - временная ветка удалена

print ("До свидание мир, рад был увидеть тебя...")
