# Первые строки кода - как всегда
# Приветствуем мир с запросом нашего имени 
# Python 3.x (act 3.5.2)

# запросим имя 
cname = input ("Введите имя: ")
# Выведем приветствие миру
print ("Hello world!!")
# Добавим - от имени кого мы приветствуем мир
print ("Мое имя: " + cname)
# Добавим строки для того чтобы расширить ветку мастер
# для того чтобы провести слияние веток
print ("Это строка добавленная для расширения мастера")

# Слияние прошло - это код - продолжение - временная ветка удалена

print ("До свидание мир...")
