# Условие
# По данному натуральному числу N найдите наибольшую целую степень двойки, 
# не превосходящую N. Выведите показатель степени и саму степень.
# 
# Операцией возведения в степень пользоваться нельзя!

n = int(input())
s = 0
i = 1
while i <= n:
    i *= 2
    s += 1

print(s-1, i//2)
