# Условие
# Последовательность состоит из натуральных чисел и завершается числом 0. 
# Определите значение наибольшего элемента последовательности.

max = 0
el = -1
while el != 0:
    el = int(input())
    if el > max:
        max = el
print(max)
