# Условие
# Определите количество четных элементов в последовательности, завершающейся числом 0.

el = -1
i = -1
while n != 0:
    el = int(input())
    if el % 2 == 0:
        i += 1
print(i)
