# Условие
# Последовательность состоит из натуральных чисел и завершается числом 0. 
# Определите, сколько элементов этой последовательности больше предыдущего элемента.

cur_el = -1
last_el = -1
i = -1
while cur_el != 0:
    cur_el = int(input())
    if cur_el > last_el:
        i += 1
    last_el = cur_el
print(i)
