# Условие
# Последовательность состоит из различных натуральных чисел и завершается числом 0. 
# Определите значение второго по величине элемента в этой последовательности. 
# Гарантируется, что в последовательности есть хотя бы два элемента.

el = int(input())
max1 = int(input())
max2 = -1

while el != 0:
    if el > max1:
        max2 = max1
        max1 = el
    elif el <= max1:
        if el > max2:
            max2 = el
    el = int(input())

print(max2)
