# Условие
# Последовательность состоит из натуральных чисел и завершается числом 0. 
# Определите, сколько элементов этой последовательности равны ее наибольшему элементу.

el = int(input())
max_el = el
i = 0

while el != 0:
    if el > max_el:
        max_el, i = el, 1
    elif el == max_el:
        i += 1
    el = int(input())

print(i)
